---
kind: other
id: Methods.T:Autodesk.Revit.DB.Architecture.Room
zh: 房间
source: html/09299ecd-1936-5e18-3d0e-5cab6abb27c7.htm
---
# Room Methods

**中文**: 房间

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.